app/CatalogoPlanesLineas.php

    public static function getPlanes(){
    	$array = DB::table('catalogo_planes_lineas')
    				->where('activo','=','1')
    				->pluck(DB::raw("CONCAT_WS('-',plan_nombre,plan_descripcion) AS descripcion"),'plan_id');
---
select CONCAT_WS('-',plan_nombre,plan_descripcion) AS descripcion, `plan_id` from `catalogo_planes_lineas` where `activo` = '1'