app/CatalogoWbs.php

    public static function Clientes(){
    	$array = ProyectosClientes::where('activo', 1)->pluck('nombre','id');
---
select `nombre`, `id` from `proyectos_clientes` where `activo` = 1