app/Coordinadores.php

select `nombre`, `id` from `catalogo_coordinadores` where `estatus` = '1' order by `nombre` asc
---
    public static function getCoordinadores(){
    	$array = CatalogoCoordinadores::where('estatus','=','1')
    				->orderBy('nombre', 'asc')
    				->pluck('nombre','id');