app/CostosIncore.php

select * from `incore`.`costos_solicitud_alta`
---
    public static function getCostos(){
    	$array = DB::table('incore.costos_solicitud_alta')
    				->select()
    				->get();