app/Estados.php

select `nombre`, `id` from `incore`.`catalogo_entidades_mexico`
---
    public static function getEstados(){
    	$array = DB::table('incore.catalogo_entidades_mexico')->pluck('nombre','id');