app/Policies/UserPolicy.php

    public function access(User $user, $permiso){
        try{
            $has = Permiso::where('codigo','=', $permiso)->first();
---
select * from `permisos` where `codigo` = 'listado_empleados' limit 1