app/Http/Controllers/DatatablesController.php

select * from `vista_empleados_activos`
---
    public function getDataEmpleados(Request $request)
    {
        $usuario = auth()->user();
        $emp      = VistaEmpleadosActivos::query();
        if ($usuario->listarTodo == null){
            if ($usuario->getCoordinador){
                $this->recursivoEmpleados($usuario->id_usuario);
                $emps = array_values(array_unique($this->array));
                $emp->whereIn('id', $emps);
            }
        }
        //Filtros
        if($request->search_id != null)
            $emp->where('id','LIKE', '%'.$request->search_id.'%');
        if($request->num_emp != null)
            $emp->where('empleado_num','LIKE', '%'.$request->num_emp.'%');
        if($request->search_nombre != null)
            $emp->where('nombre_completo','LIKE', '%'.$request->search_nombre.'%');
        if($request->search_coord != null)
            $emp->where('coordinador','LIKE', '%'.$request->search_coord.'%');
        if($request->search_pd != null)
            $emp->where('pd','LIKE', '%'.$request->search_pd.'%');
        $emp->get();