app/Http/Controllers/EmpleadosController.php

select * from `incore`.`catalogo_proveedores_recursos` where `activo` = 1
select * from `incore`.`catalogo_razonrh` where `proveedor_id` = 1
---
    public function index()
    {
        $this->authorize('access',[User::class, 'listado_empleados']);
        $clientes       = CatalogoWbs::Clientes();
        $coordinadores  = Coordinadores::getCoordinadores();
        $estados        = Estados::getEstados();
        $vistaName      = 'empleados.index';
        $ilocalidades   = Localidad::all();
        $localidades = [];
        foreach ($ilocalidades as $item){
                $localidades[] = $item->localidad_nombre;
        }
        $puestos = Puesto::all();
        $proveedores = DB::table('incore.catalogo_proveedores_recursos')
            ->select()
            ->where('activo', 1)
            ->get();
        $razones = DB::table('incore.catalogo_razonrh')
            ->select()
            ->where('proveedor_id', 1)
            ->get();