app/Http/Controllers/UsuariosController.php

select * from `incore`.`catalogo_areas`
---
    public function index()
    {
        $this->authorize('access',[User::class, 'listado_usuarios']);
        $iareas = DB::table('incore.catalogo_areas')
            ->select()
            ->get();